Table of Contents
 Class ParameterString
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
String parameter of cross-section
public class ParameterString : Parameter
Inheritance
object
OpenObject
Parameter
ParameterString
Inherited Members
 Parameter.Name
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Value
Value
public string Value { get; set; }
Property Value
string
 Edit this page